#+title: Post-Quantum Cryptography, Lattices and @@beamer:\\@@ Learning with Errors
#+subtitle: A Primer
#+options: H:2 toc:t num:t ':t
#+select_tags: export
#+exclude_tags: noexport

#+options: timestamp:nil
#+language: en
#+latex_class: beamer
#+latex_class_options: [xcolor=table,10pt,aspectratio=169]
#+property: header-args:sage :tolatex lambda obj: r'(%s)' % latex(obj) :results raw
#+author: Martin R. Albrecht
#+email: martin.albrecht@kcl.ac.uk
#+date: 
#+startup: beamer

#+latex_header: \PassOptionsToPackage{british}{babel}
#+latex_header: \setbeamerfont{alerted text}{series=\ifmmode\boldmath\else\bfseries\fi}
#+latex_header: \definecolor{gamechangecolor}{HTML}{f8e8c6}
#+latex_header: \definecolor{BrightOrange}{HTML}{f8e8c6}

#+latex_header: \tikzexternalize[prefix=tikz-figures/]
#+latex_header: \usetikzlibrary{trees}
#+latex_header: \newcommand{\Ldis}{\ensuremath{\mathcal{L}_{\mathbf{s},\chi}}\xspace}
#+latex_header: \newcommand{\rhf}{{\ensuremath{\sqrt{\alpha_{\beta}}}\xspace}}
#+latex_header: \newcommand{\KeyGen}{\ensuremath{\mathsf{KeyGen}}\xspace}
#+latex_header: \newcommand{\Enc}{\ensuremath{\mathsf{Enc}}\xspace}
#+latex_header: \newcommand{\Dec}{\ensuremath{\mathsf{Dec}}\xspace}
#+latex_header: \newcommand{\Encap}{\ensuremath{\mathsf{Encap}}\xspace}
#+latex_header: \newcommand{\Decap}{\ensuremath{\mathsf{Decap}}\xspace}
#+latex_header: \newcommand{\Sig}{\ensuremath{\Sigma}\xspace} %signature alg
#+latex_header: \newcommand{\Sign}{\ensuremath{\mathsf{Sign}}\xspace}
#+latex_header: \newcommand{\Verify}{\ensuremath{\mathsf{Verify}}\xspace}

** "Small Elements" mod \(q\)

- We can represent \(\ZZ_{q}\) with integers \(\{0, 1, \ldots, q-1\}\)
- We can also represent \(\ZZ_{q}\) with integers \(\{-\lfloor q/2 \rfloor, -\lfloor q/2 \rfloor +1, \ldots, \lfloor q/2 \rfloor\}\)  
- Example:
  #+begin_src python :kernel sagemath :exports both :results table
q = 17
K = GF(q)
[[e.lift() for e in K], [e.lift_centered() for e in K]]
  #+end_src

  #+RESULTS:
  | 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |  9 | 10 | 11 | 12 | 13 | 14 | 15 | 16 |
  | 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | -8 | -7 | -6 | -5 | -4 | -3 | -2 | -1 |

- The latter representation is called "centred" or "balanced".
- We often implicitly assume the "centred" representation.  
- We informally say that \(e \in \ZZ_{q}\) is "small" if its balanced representation is small in absolute value.
 
** Concrete Hardness: Cryptanalysis

- This tells us random \(q\)-ary lattices are not a terrible choice
- To establish how long it actually takes to solve LWE, we rely on cryptanalysis
 
  #+begin_src python :kernel sagemath :dir /home/malb/Projects/lattices/estimator :exports both
from estimator import *
schemes.Kyber512
  #+end_src

  #+RESULTS:
  : LWEParameters(n=512, q=3329, Xs=D(σ=1.22), Xe=D(σ=1.22), m=512, tag='Kyber 512')

  #+begin_src python :kernel sagemath :dir /home/malb/Projects/lattices/estimator :exports both
LWE.primal_usvp(schemes.Kyber512)
  #+end_src

  #+RESULTS:
  : rop: ≈2^143.8, red: ≈2^143.8, δ: 1.003941, β: 406, d: 998, tag: usvp

#+begin_center
https://github.com/malb/lattice-estimator/
#+end_center

